#Створити словник характеристик довільного автомобіля (марка, модель, рік, двигун і тд.)
car = {
    "brand": "audi",
    "model": "A4",
    "year": 2017,
    "engine": "2.0"
}
#Видалити зі словника і вивести на еран рік автомобіля.
s = car.pop("year")
print(s)

#Створити дві довільні множини чисел, знайти спільні елементи в них
s1 = {1, 2, 5, 7, 8, 9}
s2 = {1, 3, 4, 5, 6, 8}
print(s1.intersection(s2))

#За допомогою клавіатури заповнити дві змінні password i repead_password надрукувати True в консоль якщо вони рівні в іншому випадку False.
password = "kdfjhvuf"
repead_password = "kdfjhvuf"
print(password == repead_password)

#Створити довільний список, перетворити його в tuple i вивести перші три елементи.
a = [3,4,7,9,8,5]
a = tuple(a)
print(type(a))
print(a[0:3])

#Знайти mod (остача від цілечисленого ділення) 121 на 7
a = 121
b = 7
print(a % b)

#Знайти div (цілечислене ділення) 121 на 7
a = 121
b = 7
print(a // b)

#Обчислити 2 в степіні 10 ( 2^10 )
a = 2
print(a ** 10)